~/Documents/BACKUP/coanda_simple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          71;
        startFace       31099;
    }
    right
    {
        type            patch;
        nFaces          75;
        startFace       31170;
    }
    up
    {
        type            patch;
        nFaces          71;
        startFace       31245;
    }
    meanFlow
    {
        type            patch;
        nFaces          92;
        startFace       31316;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          329;
        startFace       31408;
    }
    coandaUpper
    {
        type            patch;
        nFaces          10;
        startFace       31737;
    }
    coandaLower
    {
        type            patch;
        nFaces          10;
        startFace       31747;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          31428;
        startFace       31757;
    }
)

// ************************************************************************* //
